tap "1password/tap"
tap "charmbracelet/tap"
tap "daipeihust/tap"
tap "gbataille/gba"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "muesli/tap"
tap "possatti/possatti"
brew "act"
brew "libpng"
brew "freetype"
brew "libffi"
brew "pkg-config"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.9"
brew "zstd"
brew "icu4c"
brew "ansible"
brew "openjdk"
brew "antlr"
brew "apr-util"
brew "aria2"
brew "asciinema"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "bfg"
brew "bison"
brew "carthage"
brew "cmake"
brew "gmp"
brew "coreutils"
brew "ctop"
brew "diff-so-fancy"
brew "docker", link: false
brew "dotnet"
brew "dotnet@6"
brew "wxwidgets"
brew "exa"
brew "exercism"
brew "exiftool"
brew "fd"
brew "gnutls"
brew "rav1e"
brew "ffmpeg"
brew "flyctl"
brew "fop"
brew "fortune"
brew "fzf"
brew "gcc@11"
brew "gd"
brew "gh"
brew "ghcup"
brew "git"
brew "git-lfs"
brew "glances"
brew "global"
brew "gnu-sed"
brew "libxml2"
brew "gnumeric"
brew "pinentry"
brew "gnupg"
brew "jpeg", link: true
brew "graphviz"
brew "haskell-language-server"
brew "haskell-stack"
brew "htmlq"
brew "htop"
brew "httpd"
brew "huggingface-cli"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "imagesnap"
brew "jenv"
brew "oniguruma"
brew "jq"
brew "kerl"
brew "krb5"
brew "lazygit"
brew "libedit"
brew "libiconv"
brew "libxslt"
brew "libzip"
brew "lima"
brew "litecli"
brew "localstack"
brew "mariadb"
brew "mas"
brew "mono-libgdiplus"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nginx"
brew "ninja"
brew "pandoc"
brew "pinentry-mac"
brew "postgresql@14", restart_service: true
brew "protobuf"
brew "tcl-tk"
brew "python-tk@3.9"
brew "qpdf"
brew "rabbitmq"
brew "re2c"
brew "rebar3"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "rust-analyzer"
brew "shellcheck"
brew "subversion"
brew "terraform"
brew "tokei"
brew "trash"
brew "tre-command"
brew "tree"
brew "ttyd", args: ["HEAD"]
brew "vim"
brew "watchexec"
brew "wget"
brew "wireguard-tools"
brew "youtube-dl"
brew "yq"
brew "yt-dlp"
brew "z3"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "charmbracelet/tap/vhs"
brew "daipeihust/tap/im-select"
brew "gbataille/gba/githud"
brew "muesli/tap/duf"
brew "possatti/possatti/pokemonsay"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "anki"
cask "audacity"
cask "calibre"
cask "canva"
cask "charles"
cask "commander-one"
cask "daisydisk"
cask "dash"
cask "deckset"
cask "deepl"
cask "discord"
cask "docker"
cask "dropbox"
cask "fig"
cask "firefox"
cask "font-baskervville"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-cormorant-garamond"
cask "font-fantasque-sans-mono"
cask "font-fira-code-nerd-font"
cask "font-hasklig"
cask "font-intel-one-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-libre-baskerville"
cask "font-noto-mono"
cask "font-noto-sans-cjk"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "grammarly-desktop"
cask "hammerspoon"
cask "hook"
cask "iina"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kaleidoscope"
cask "kobo"
cask "kodi"
cask "ledger-live"
cask "livebook"
cask "logitech-options"
cask "logitech-presentation"
cask "logseq"
cask "luxmark"
cask "mactex"
cask "mark-text"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "miro"
cask "mono-mdk-for-visual-studio"
cask "musescore"
cask "notion"
cask "obsidian"
cask "onedrive"
cask "owasp-zap"
cask "pdf-expert"
cask "postman"
cask "qview"
cask "raindropio"
cask "raycast"
cask "setapp"
cask "shureplus-motiv"
cask "sizzy"
cask "sketch"
cask "skype"
cask "slab"
cask "sourcetree"
cask "spotify"
cask "squirrel"
cask "steam"
cask "surfshark"
cask "suspicious-package"
cask "transmission"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "welly"
cask "wkhtmltopdf"
cask "xld"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Bluefruit Connect", id: 1494760882
mas "Calcbot", id: 931657367
mas "CalcTape", id: 945336271
mas "Clearview", id: 557090104
mas "Cloud Battery", id: 1481005137
mas "Coin Stats", id: 1387758574
mas "Coin Stats", id: 1498417304
mas "Copied", id: 1026349850
mas "Crypto Pro", id: 980888073
mas "DaisyDisk", id: 411643860
mas "Debit & Credit", id: 882637653
mas "Developer", id: 640199958
mas "Disk Speed Test", id: 425264550
mas "Drafts", id: 1435957248
mas "Eagle for Safari", id: 1526651672
mas "Exchange Rates", id: 1463361068
mas "Fantastical", id: 975937182
mas "Final Cut Pro", id: 424389933
mas "Gemini 2", id: 1090488118
mas "GoodNotes", id: 1444383602
mas "Grammarly for Safari", id: 1462114288
mas "Highlights", id: 1498912833
mas "iMovie", id: 408981434
mas "iReal Pro", id: 409035833
mas "Kagi Inc.", id: 1622835804
mas "Key Codes", id: 414568915
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Logic Pro", id: 634148309
mas "Magnet", id: 441258766
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Moom", id: 419330170
mas "Musicnotes", id: 1025073421
mas "nkoda", id: 1386771502
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pastebot", id: 1179623856
mas "Playgrounds", id: 1496833156
mas "PLIST Editor", id: 1157491961
mas "QR Journal", id: 483820530
mas "Reader", id: 1179373118
mas "Save to Raindrop.io", id: 1549370672
mas "Save to Reader", id: 1640236961
mas "Slack", id: 803453959
mas "Smart JSON Editor", id: 1268962404
mas "Soulver 2", id: 413965349
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "Tab Space", id: 1473726602
mas "Tayasui Sketches", id: 1178074963
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "TheExplorers", id: 1436285774
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
mas "熊掌記（Bear）", id: 1091189122
vscode "adpyke.vscode-sql-formatter"
vscode "agutierrezr.emmet-keybindings"
vscode "alefragnani.Bookmarks"
vscode "animus-coop.vscode-elixir-mix-formatter"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bradlc.vscode-tailwindcss"
vscode "chrmarti.regex"
vscode "clarkyu.vscode-sql-beautify"
vscode "cschlosser.doxdocgen"
vscode "deerawan.vscode-dash"
vscode "dnlytras.nord-wave"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "faldor20.fsharp-language-server-updated"
vscode "gerane.Theme-AgolaDark"
vscode "gerane.Theme-Smyck"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "Gruntfuggly.todo-tree"
vscode "huytd.nord-light"
vscode "idleberg.applescript"
vscode "Ionide.Ionide-fsharp"
vscode "Ionide.Ionide-Paket"
vscode "JakeBecker.elixir-ls"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jmreicha.tender"
vscode "JohnnyMorganz.stylua"
vscode "josecfreittas.livebook"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-zh-hant"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "pantajoe.vscode-elixir-credo"
vscode "phoenixframework.phoenix"
vscode "pnp.polacode"
vscode "rebornix.ruby"
vscode "reliutg.visual-regex"
vscode "rust-lang.rust-analyzer"
vscode "scmlab.guabao"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "tobias-z.vscode-harpoon"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vincaslt.highlight-matching-tag"
vscode "voorjaar.windicss-intellisense"
vscode "vscodevim.vim"
vscode "wingrunr21.vscode-ruby"
vscode "withfig.fig"
vscode "yinfei.luahelper"
