tap "gbataille/gba"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "possatti/possatti"
tap "rs/tap"
tap "universal-ctags/universal-ctags"
tap "wagoodman/dive"
tap "xo/xo"

brew "ack"
brew "glib"
brew "pixman"
brew "cairo"
brew "jpeg"
brew "icu4c"
brew "libcroco"
brew "ansible"
brew "asciinema"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "bash"
brew "bat"
brew "bison"
brew "boost"
brew "brew-cask-completion"
brew "cmake"
brew "faad2"
brew "libogg"
brew "flac"
brew "gmp"
brew "libunistring"
brew "nettle"
brew "gnutls"
brew "lame"
brew "libvorbis"
brew "xvid"
brew "ffmpeg"
brew "libcue"
brew "mad"
brew "mp4v2"
brew "cmus"
brew "cocoapods"
brew "coreutils"
brew "cowsay"
brew "cscope"
brew "csvkit"
brew "curl"
brew "dnscrypt-proxy"
brew "doitlive"
brew "enca"
brew "entr"
brew "epubcheck"
brew "exa"
brew "exercism"
brew "exiftool"
brew "fd"
brew "fish"
brew "fortune"
brew "fselect"
brew "fwup"
brew "fx"
brew "fzf"
brew "gist"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "libxml2"
brew "gnumeric"
brew "gnupg"
brew "go"
brew "googler"
brew "gpatch"
brew "gts"
brew "graphviz"
brew "haskell-stack"
brew "htop"
brew "httperf"
brew "httpie"
brew "hub"
brew "shared-mime-info"
brew "libtool"
brew "imagemagick"
brew "imageoptim-cli"
brew "io"
brew "irssi"
brew "ispell"
brew "jp2a"
brew "jpeg-archive"
brew "jq"
brew "libao"
brew "libmagic"
brew "libsass"
brew "libtensorflow"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libxslt"
brew "m-cli"
brew "mas"
brew "memcached", restart_service: true
brew "minimal-racket"
brew "mono"
brew "mosh"
brew "msgpack"
brew "multitail"
brew "ncdu"
brew "neovim"
brew "no-more-secrets"
brew "noti"
brew "opam"
brew "opencc"
brew "optipng"
brew "packer"
brew "packer-completion"
brew "pandoc"
brew "pgcli"
brew "picocom"
brew "pidof"
brew "pkg-config"
brew "pngquant"
brew "postgresql", restart_service: true
brew "prettyping"
brew "prometheus"
brew "pstree"
brew "python@2"
brew "qt"
brew "qcachegrind"
brew "qpdf"
brew "ranger"
brew "rclone"
brew "redis", restart_service: true
brew "rename"
brew "ripgrep"
brew "rsync"
brew "smartmontools"
brew "socat"
brew "speedtest-cli"
brew "squashfs"
brew "ssh-copy-id"
brew "stormssh"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tokei"
brew "trash"
brew "tree"
brew "unixodbc"
brew "vim"
brew "watchman"
brew "wget"
brew "wrk"
brew "wxmac"
brew "xctool"
brew "yamllint"
brew "yank"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "gbataille/gba/githud"
brew "possatti/possatti/pokemonsay"
brew "rs/tap/jplot"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "wagoodman/dive/dive"

cask "adobe-acrobat-reader"
cask "alfred"
cask "anki"
cask "balenaetcher"
cask "bartender"
cask "bettertouchtool"
cask "calibre"
# cask "charles"
cask "colorpicker-developer"
cask "colorpicker-rcwebcolorpicker"
cask "colorpicker-skalacolor"
# cask "contexts"
# cask "dash"
# cask "deckset"
cask "dictunifier"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
# cask "dropzone"
# cask "fantastical"
cask "firefox"
cask "flowdock"
cask "font-andale-mono"
cask "font-b612"
cask "font-bitstream-vera"
cask "font-coming-soon"
cask "font-cousine"
cask "font-dejavu-sans"
cask "font-edlo"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-hasklig"
cask "font-iosevka"
cask "font-kalam"
cask "font-liberation-sans"
cask "font-noto-mono"
cask "font-noto-sans-cjk"
cask "font-open-sans"
cask "font-public-sans"
cask "font-roboto"
cask "font-roboto-slab"
cask "font-source-code-pro"
cask "font-source-han-sans"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "fontbase"
cask "freac"
cask "google-backup-and-sync"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "grammarly"
cask "hammerspoon"
cask "handbrake"
# cask "hazel"
# cask "istat-menus"
cask "iterm2"
cask "java"
cask "jetbrains-toolbox"
# cask "kaleidoscope"
cask "karabiner-elements"
cask "keybase"
cask "kitematic"
# cask "kkbox"
cask "kobo"
# cask "logitech-control-center"
cask "mactex"
cask "mark-text"
cask "messenger"
cask "mpv"
cask "ngrok"
# cask "notion"
# cask "omnifocus"
# cask "omnigraffle"
cask "onedrive"
# cask "paw"
# cask "pdf-expert"
# cask "pdfpenpro"
cask "pineapple"
cask "podman"
# cask "postico"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
# cask "screenflow"
# cask "setapp"
# cask "sketch"
cask "skim"
cask "skype"
cask "slack"
cask "soundflower"
cask "soundflowerbed"
cask "sourcetree"
cask "squirrel"
cask "standard-notes"
cask "steam"
cask "suspicious-package"
cask "transmission"
cask "twist"
cask "typora"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "welly"
cask "whatsapp"
cask "wireshark"
cask "xbox360-controller-driver-unofficial"
# cask "xquartz"
cask "zoom"

# mas "1Password 7", id: 1333542190
# mas "Be Focused Pro", id: 961632517
mas "Bear", id: 1091189122
# mas "Capo", id: 696977615
# mas "Copied", id: 1026349850
# mas "DaisyDisk", id: 411643860
mas "Disk Speed Test", id: 425264550
# mas "Dropzone 3", id: 695406827
mas "Grammarly for Safari", id: 1462114288
# mas "Irvue", id: 1039633667
mas "Jayson", id: 1189824719
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
# mas "Moom", id: 419330170
mas "OneDrive", id: 823766827
# mas "SketchBook", id: 863486266
mas "Slack", id: 803453959
mas "Smart JSON Editor", id: 1268962404
# mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
