tap "homebrew/services"
tap "lihaoyun6/tap"
tap "michaeldfallen/formula"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "possatti/possatti"
tap "qmk/qmk"
tap "romkatv/gitstatus"
# Simple, modern, secure file encryption
brew "age"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Utility to read Word (.doc) files
brew "antiword"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# General purpose syntax highlighter in pure Go
brew "chroma"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared", restart_service: :changed
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# .NET Core
brew "dotnet"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Text to speech, software speech synthesizer
brew "espeak"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Configurable static site generator
brew "hugo"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit"
# Music engraving system
brew "lilypond"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# General-purpose scripting language
brew "php"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Editor of encrypted files
brew "sops"
# Log file highlighter
brew "tailspin"
# Tool to build, change, and version infrastructure
brew "terraform"
# Official tldr client written in Rust
brew "tlrc"
# Program that allows you to count code, quickly
brew "tokei"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Tree command, improved
brew "tre-command"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Image processing library
brew "vips"
# Next generation frontend tooling. It's fast!
brew "vite"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich Syntax Highlighting for Zsh
brew "zsh-f-sy-h"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# "pokemonsay" is like "cowsay" but for pokémon.
brew "possatti/possatti/pokemonsay"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Git status for Bash/Zsh prompt
brew "romkatv/gitstatus/gitstatus"
# Get the battery level of all your devices on your Mac.
cask "airbattery"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# E-books management software
cask "calibre"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Allows switching between application windows
cask "contexts"
# Write, edit, and chat about your code with AI
cask "cursor"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-noto-sans-cjk-tc"
# LilyPond editor
cask "frescobaldi"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Automated organisation
cask "hazel"
# Automation software
cask "keyboard-maestro"
# Open-source keystroke visualiser
cask "keycastr"
# Desktop reader for Kobo eBooks
cask "kobo"
# Code notebooks for Elixir developers
cask "livebook"
# Software for Logitech devices
cask "logi-options+"
# PDF editor
cask "master-pdf-editor"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Multi-platform web browser
cask "microsoft-edge"
# Online collaborative whiteboard platform
cask "miro"
# Open-source music notation software
cask "musescore"
# Neovim Client
cask "neovide-app"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# PDF reader, editor and annotator
cask "pdf-expert"
# Control your tools with a few keystrokes
cask "raycast"
# Screen recording and video editing software
cask "screenflow"
# Tool to simulate responsive designs on multiple devices
cask "sizzy"
# Graphical client for Git version control
cask "sourcetree"
# Utility to hide the notch
cask "topnotch"
# Configurable document editor that supports Markdown
cask "typora"
# Rust-based terminal
cask "warp"
# BBS client
cask "welly"
# Connect to Windows
cask "windows-app"
# Lossless audio decoder
cask "xld"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Multiplayer code editor
cask "zed"
vscode "4ops.terraform"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.bookmarks"
vscode "animus-coop.vscode-elixir-mix-formatter"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "chrmarti.regex"
vscode "cschlosser.doxdocgen"
vscode "deerawan.vscode-dash"
vscode "dnlytras.nord-wave"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "elixir-tools.elixir-tools"
vscode "esbenp.prettier-vscode"
vscode "faldor20.fsharp-language-server-updated"
vscode "gerane.theme-agoladark"
vscode "gerane.theme-smyck"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "gruntfuggly.todo-tree"
vscode "haskell.haskell"
vscode "hoovercj.vscode-power-mode"
vscode "huytd.nord-light"
vscode "idleberg.applescript"
vscode "ionide.ionide-fsharp"
vscode "ionide.ionide-paket"
vscode "jmreicha.tender"
vscode "johnnymorganz.stylua"
vscode "justusadam.language-haskell"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "pantajoe.vscode-elixir-credo"
vscode "phoenixframework.phoenix"
vscode "pnp.polacode"
vscode "pranjalkumar.minimal-kiwi"
vscode "reliutg.visual-regex"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "samuel-pordeus.elixir-test"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "tamasfe.even-better-toml"
vscode "tobias-z.vscode-harpoon"
vscode "tootone.org-mode"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "voorjaar.windicss-intellisense"
vscode "vscodevim.vim"
vscode "yinfei.luahelper"
vscode "zhuangtongfa.material-theme"
